import { DateProps } from '@/types';

export const dates: DateProps[] = [
    {
        topic: 'Кино',
        keysDates: [
            { date: 1990, text: 'Вышел фильм "Крестный отец 3" режисера Фрэнсиса Форда Копполы, завершивший эпическую трилогию о семье мафиози Корлеоне' },
            { date: 1991, text: 'Состоялась премьера фильма "Молчание Ягнят" режисера Джонатана Демми, который стал восторженно принят публикой и критиками' },
            { date: 1992, text: 'Премьера фильма "Байки из склепа" режисера Питера Джексона произвела фурор в жанре комедийного ужаса' },
            { date: 1993, text: 'Премьера фильма "Воздушный замок" режисера Ларса фон Триера привлекла внимание фестивальной публики и кинокритиков' },
            { date: 1994, text: 'Снят фильм "Форрест Гамп" режиссера Роберта Земекиса, который стал одним из наиболее успешных и популярных фильмов десятилетия' },
        ]
    },
    {
        topic: 'Искусство',
        keysDates: [
            { date: 1995, text: 'Была проведена первая миссия Хаббловского телескопа. Это превело к созданию изображений космических обьектов' },
            { date: 1996, text: 'Проходила выстовка Сундук Эшера в Национальной галерее искусств в Вашингтоне' },
            { date: 1997, text: 'Лувр в Парише открыл Галерею Леонрадо да Винчи, где были представленны величественные произведения итальянского художника' },
            { date: 1998, text: 'Были обнаруженны фрески Тридентсского цикла в Капелле Скривиньи в Систинской капелле в Ватикане' },
            { date: 1999, text: 'Был восстановлен Собор Нотр-Дам в Париже после 20 летней реставрации' },
        ]
    },
    {
        topic: 'Природа',
        keysDates: [
            { date: 2000, text: 'Сосотялся Миллениумский саммит ООН, на котором была принята Миллениумская декларация, среди целей которой было лбеспечение устойчивого развития и сохранение природных ресурсов' },
            { date: 2001, text: 'Произошло занменитое землетресение в Индийском океане и последубщее цунами, которое привело к огромным разрушениям' },
            { date: 2002, text: 'Состоялась Всемирная Конференция по устойчивому развитию в Йоханнесбурге, ЮАР, на которой обсуждались проблемы окружающей стреды и климатических изменений' },
            { date: 2003, text: 'Произошло явление Летучей мыши в Америке которое привело к вспышке вируса Синдрома острого респираторного синдрома и привекло внимение мировой общественности' },
            { date: 2004, text: 'Произошло сильнейшее землетрясение в Индийском океане, вызвавшее цунами, которое затронуло несколько стран  и привело к гибели более 230 000 человек' },
        ]
    },
    {
        topic: 'Наука',
        keysDates: [
            { date: 2005, text: 'Была завершена полная секвенирование генома шимпанзе, что помогло углубить наше понимание эволиции и исследования происхождения человека' },
            { date: 2006, text: 'Международный союз по чистому и прикладному химическому изучению провозгласил открытие нового химического элемента - коперниций' },
            { date: 2007, text: 'Был выпущен первый iPhone, что стало переломным моментом в истории смартфонов и завершило преобразование мобильных устройств в источники всесторонней информации и коммуникации' },
            { date: 2008, text: 'Был запущен первый коллайдер large Hadron Collider, что позволило ученым исследовать фундаментальные частицы и физические теории, расширяя наше знание о строении Вселенной' },
            { date: 2009, text: 'Международный проект генома коровы официально был завершен, что открыло новые возможности в изучении ненетики животных и технологий селекциию' },
        ]
    },
    {
        topic: 'Литература',
        keysDates: [
            { date: 2010, text: 'Американский писатель Джонатан Франзен выпустил свой роман "Свобода", который получил огромное внимание и стал бестселлером' },
            { date: 2011, text: 'Вышла книга "45 лет спустя" японской писательницы Харуки Мураками. Роман стал международным бестселлером и известен своей философией, символизмом и магическим реализмом' },
            { date: 2012, text: 'Американский журналист Тони Моррисон получил Нобелевскую премию по литературе за свой значительный вклад в американскую литературу, особенно за его романы о черной жизни и идентичности' },
            { date: 2013, text: 'Американский писатель Джон Грин выпустил свой роман "Виноваты звезды", который стал международным бестселлером и привлек внимание своим эмоциональными и глубокими размышлениями о любви, жизни и смерти' },
            { date: 2014, text: 'Вышел роман "Верность" американской писательницы Елены Ферранте, который стал одной из самых обсуждаемых книг года и получил признание критиков' },
        ]
    },
    {
        topic: 'Технологии',
        keysDates: [
            { date: 2015, text: 'Google представила проект Google DeepMind AlphaGo, искусственного интеллекта способного обыграть чемпиона мира по игре Го' },
            { date: 2016, text: 'Tesla Motors представила электромобиль Teslf Model 3 , доступный по более низкой цене, что стало катализатором роста рынка электормобилей' },
            { date: 2017, text: 'Apple представила iPhone X который включал новое инновационное распознование лица Face ID и изогнутый безрамочный дисплей' },
            { date: 2018, text: 'SpaceX, компания Илона Маска, успешно запустила и вернула ракету Falcon Heavy с использованием повторно используемых составных частей' },
            { date: 2019, text: 'Facebook анонсирован проект libra, криптовалюту на основе блокчейна. Это вызвало широкий общественный интерес и подняло обсуждение о роли искусственного интеллекта и цифровых валют в мировой экономике' },
        ]
    },
];